import { ISection } from "./section.interface";
import styles from "./sections.module.scss";

const sections: ISection[] = [
    {
        img: "/banners/section-1.png",
        title: "Засоби для прання",
        description:
            "Обрати безпечний і водночас по-справжньому дієвий засіб для прання – це ще той виклик! Утім, серед нашої продукції ви з легкістю знайдете як традиційній порошкові пральні засоби, так і концентровані гелі чи порційні капсули для легкого та ефективного прання в будь-яких умовах як у машинці, так і вручну. Безфосфатні, гіпоалергенні, універсальні, для кольорових чи однотонних речей, для делікатних типів тканин, для дитячої білизни – асортимент Clovin точно допоможе обрати саме той пральний засіб, який задовольнить усі потреби найвибагливіших господарів і господинь!",
    },
    {
        img: "/banners/section-2.png",
        title: "Допоміжні засоби",
        description:
            "Надскладні типи забруднень – це не привід опускати руки, адже серед асортименту продукції ТМ Clovin Ви зможете знайти та придбати численні допоміжні засоби побутової хімії для повернення речам їх первинного бездоганного вигляду! В арсеналі допоміжної побутової хімії наявні сухі та рідкі відбілювачі для відновлення білосніжного кольору тканин, ополіскувачі-кондиціонери для м’якості, ароматизації та покращення еластичності будь-яких волокон, а також спеціальні засоби, що допоможуть подбати про текстильні поверхні в інтер’єрі (килими, оббивка диванів чи крісел, штори, скатертини тощо).",
    },
    {
        img: "/banners/section-3.png",
        title: "Посудомийні засоби",
        description:
            "Хтось надає перевагу миттю посуду вручну, хтось довіряє цю справу посудомийній машині. Хай там як, а без спеціальних засобів побутової хімії цей процес у будь-якому разі не обходиться. Завдяки ТМ Clovin ви швидко дасте раду горам немитого посуду, а ще зможете подбати про стан Вашої посудомийної машини, адже, окрім концентрованих рідких засобів чи гелів для миття посуду, ми пропонуємо спеціальні засоби для автоматичних посудомийних машин: таблетки для чищення посудомийної машини, ароматизатори, що усувають всі неприємні запахи, спеціальну побутову хімію для скляних та порцелянових виробів, що повертають сліпучий блиск та допомагають позбутися ненависних розводів і патьоків тощо.",
    },
    {
        img: "/banners/section-4.png",
        title: "Засоби для прибирання",
        description:
            "Професійний клінінг-сервіс по кишені не всім, однак бюджетна, ефективна та безпечна побутова хімія стане кращим вирішенням цієї ситуації і водночас найраціональнішим способом підтримання оселі, офісів, закладів громадського обслуговування у чистоті та порядку. ТМ Clovin пропонує широкий асортимент якісних та дієвих засобів як універсального, так і вузького застосування, серед яких рідкі засоби для миття підлоги і численних поверхонь, побутова хімія для ванної та унітазу, ароматизатори приміщень, дезінфектори обладнання та побутової техніки тощо. Всі вони відповідають європейським сертифікатам якості і гарантують видимий результат вже після першого використання.",
    },
    {
        img: "/banners/section-5.png",
        title: "Мило для рук",
        description:
            "Гігієна рук – це те, чим не варто нехтувати, але підібрати хороший і перевірений засіб для миття рук подеколи досить проблематично. Одначе ТМ Clovin відомо про цю проблему. Саме тому формули мила для рук продумані до найменших дрібниць: воно має чудові піноутворювальні властивості, досить економне у використанні за рахунок високої концентрації активної речовини, не пересушує і не стягує чутливу шкіру рук, не провокує подразнення та алергічні прояви і що не менш важливо – широкий асортимент продукції рідкого та твердого (брускового) мила дозволяє обрати саме ту бажану ароматизацію гігієнічного засобу, аби максимально сприяти приємній атмосфері у ванній кімнаті.",
    },
];

export const Sections = (): JSX.Element => {
    return (
        <section className={styles.sections} id="products">
            {sections.map((section, index) => (
                <div
                    key={index}
                    className={`${styles.section} ${
                        index % 2 === 1 ? styles.reversed : ""
                    }`}
                >
                    <img src={section.img} alt={section.title} />
                    <div className={styles.textColumn}>
                        <h2>{section.title}</h2>
                        <p>{section.description}</p>
                    </div>
                </div>
            ))}
        </section>
    );
};
